; domain
(define (domain p1)
(:requirements :strips :typing)

(:types 
    location 
    crate 
    content
    person
    drone
    arm
) 

(:predicates 
    (person-at ?person - person ?location - location)
    (is-injured ?person - person)
    (crate-at ?crate - crate ?location - location)
    (content-crate ?content - content ?crate - crate)
    (has-content-person ?person - person ?content - content)
    (person-need ?person - person ?content - content)
    (drone-at ?drone - drone ?location - location)
    (has-crate-drone-arm ?drone - drone ?arm - arm ?crate - crate)
    (empty-arm ?drone - drone ?arm - arm)
)

(:action pick-up-crate
    :parameters (
        ?crate - crate
        ?location - location
        ?drone - drone
        ?arm - arm
    )
    :precondition (and 
        (empty-arm ?drone ?arm)                 
        (drone-at ?drone ?location)       
        (crate-at ?crate ?location)           
    )
    :effect (and
        (has-crate-drone-arm ?drone ?arm ?crate)     
        (not (empty-arm ?drone ?arm))           
        (not (crate-at ?crate ?location))     
    )
)

(:action drone-move
    :parameters (
        ?location_from - location
        ?location_to - location
        ?drone - drone
    )
    :precondition (and 
        (drone-at ?drone ?location_from)  
    )
    :effect (and 
        (not (drone-at ?drone ?location_from)) 
        (drone-at ?drone ?location_to)         
    )
)

(:action drop-crate
    :parameters (
        ?location - location
        ?person - person
        ?crate - crate
        ?arm - arm
        ?content - content
        ?drone - drone
    )
    :precondition (and 
        (person-at ?person ?location)     
        (drone-at ?drone ?location)       
        (has-crate-drone-arm ?drone ?arm ?crate)     
        (content-crate ?content ?crate)       
        (person-need ?person ?content)    
    )
    :effect (and 
        (not (has-crate-drone-arm ?drone ?arm ?crate))   
        (has-content-person ?person ?content) 
        (empty-arm ?drone ?arm)                      
)
)
)

; problem
(define (problem drone_problem_d1_r0_l17_p17_c17_g17_ct2)
(:domain p1)
(:objects
	drone1 - drone
	depot - location
	warehouse - location
	loc1 - location
	loc2 - location
	loc3 - location
	loc4 - location
	loc5 - location
	loc6 - location
	loc7 - location
	loc8 - location
	loc9 - location
	loc10 - location
	loc11 - location
	loc12 - location
	loc13 - location
	loc14 - location
	loc15 - location
	loc16 - location
	loc17 - location
	crate1 - crate
	crate2 - crate
	crate3 - crate
	crate4 - crate
	crate5 - crate
	crate6 - crate
	crate7 - crate
	crate8 - crate
	crate9 - crate
	crate10 - crate
	crate11 - crate
	crate12 - crate
	crate13 - crate
	crate14 - crate
	crate15 - crate
	crate16 - crate
	crate17 - crate
	food - content
	medicine - content
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	person10 - person
	person11 - person
	person12 - person
	person13 - person
	person14 - person
	person15 - person
	person16 - person
	person17 - person
	left right - arm
)
(:init
	(drone-at drone1 depot)
	(crate-at crate1 warehouse)
	(crate-at crate2 warehouse)
	(crate-at crate3 warehouse)
	(crate-at crate4 warehouse)
	(crate-at crate5 warehouse)
	(crate-at crate6 warehouse)
	(crate-at crate7 warehouse)
	(crate-at crate8 warehouse)
	(crate-at crate9 warehouse)
	(crate-at crate10 warehouse)
	(crate-at crate11 warehouse)
	(crate-at crate12 warehouse)
	(crate-at crate13 warehouse)
	(crate-at crate14 warehouse)
	(crate-at crate15 warehouse)
	(crate-at crate16 warehouse)
	(crate-at crate17 warehouse)
	(empty-arm drone1 left)
	(empty-arm drone1 right)
	(content-crate food crate1)
	(content-crate food crate2)
	(content-crate food crate3)
	(content-crate food crate4)
	(content-crate food crate5)
	(content-crate food crate6)
	(content-crate medicine crate7)
	(content-crate medicine crate8)
	(content-crate medicine crate9)
	(content-crate medicine crate10)
	(content-crate medicine crate11)
	(content-crate medicine crate12)
	(content-crate medicine crate13)
	(content-crate medicine crate14)
	(content-crate medicine crate15)
	(content-crate medicine crate16)
	(content-crate medicine crate17)
	(person-at person1 loc1)
	(person-at person2 loc6)
	(person-at person3 loc15)
	(person-at person4 loc14)
	(person-at person5 loc5)
	(person-at person6 loc9)
	(person-at person7 loc11)
	(person-at person8 loc11)
	(person-at person9 loc8)
	(person-at person10 loc2)
	(person-at person11 loc11)
	(person-at person12 loc11)
	(person-at person13 loc10)
	(person-at person14 loc9)
	(person-at person15 loc16)
	(person-at person16 loc15)
	(person-at person17 loc9)
	(person-need person1 food)
	(person-need person2 food)
	(person-need person2 medicine)
	(person-need person3 food)
	(person-need person5 medicine)
	(person-need person6 medicine)
	(person-need person7 food)
	(person-need person7 medicine)
	(person-need person8 medicine)
	(person-need person9 food)
	(person-need person10 medicine)
	(person-need person11 medicine)
	(person-need person12 medicine)
	(person-need person14 medicine)
	(person-need person16 food)
	(person-need person16 medicine)
	(person-need person17 medicine)
)
(:goal (and
	(drone-at drone1 depot)
	(has-content-person person1 food)
	(has-content-person person2 food)
	(has-content-person person2 medicine)
	(has-content-person person3 food)
	(has-content-person person5 medicine)
	(has-content-person person6 medicine)
	(has-content-person person7 food)
	(has-content-person person7 medicine)
	(has-content-person person8 medicine)
	(has-content-person person9 food)
	(has-content-person person10 medicine)
	(has-content-person person11 medicine)
	(has-content-person person12 medicine)
	(has-content-person person14 medicine)
	(has-content-person person16 food)
	(has-content-person person16 medicine)
	(has-content-person person17 medicine)
))
)

; plan
1. (drone-move depot warehouse drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 warehouse)
   goals met: 0 of 18
2. (pick-up-crate crate1 warehouse drone1 right)
   deleted: (empty-arm drone1 right) (crate-at crate1 warehouse)
   added: (has-crate-drone-arm drone1 right crate1)
   goals met: 0 of 18
3. (pick-up-crate crate7 warehouse drone1 left)
   deleted: (empty-arm drone1 left) (crate-at crate7 warehouse)
   added: (has-crate-drone-arm drone1 left crate7)
   goals met: 0 of 18
4. (drone-move warehouse loc1 drone1)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc1)
   goals met: 0 of 18
5. (drop-crate loc1 person1 crate1 right food drone1)
   deleted: (has-crate-drone-arm drone1 right crate1)
   added: (has-content-person person1 food) (empty-arm drone1 right)
   goals met: 1 of 18
6. (drone-move loc1 warehouse drone1)
   deleted: (drone-at drone1 loc1)
   added: (drone-at drone1 warehouse)
   goals met: 1 of 18
7. (pick-up-crate crate2 warehouse drone1 right)
   deleted: (empty-arm drone1 right) (crate-at crate2 warehouse)
   added: (has-crate-drone-arm drone1 right crate2)
   goals met: 1 of 18
8. (drone-move warehouse loc6 drone1)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc6)
   goals met: 1 of 18
9. (drone-move loc6 loc5 drone1)
   deleted: (drone-at drone1 loc6)
   added: (drone-at drone1 loc5)
   goals met: 1 of 18
10. (drop-crate loc5 person5 crate7 left medicine drone1)
   deleted: (has-crate-drone-arm drone1 left crate7)
   added: (has-content-person person5 medicine) (empty-arm drone1 left)
   goals met: 2 of 18
11. (drone-move loc5 warehouse drone1)
   deleted: (drone-at drone1 loc5)
   added: (drone-at drone1 warehouse)
   goals met: 2 of 18
12. (pick-up-crate crate8 warehouse drone1 left)
   deleted: (empty-arm drone1 left) (crate-at crate8 warehouse)
   added: (has-crate-drone-arm drone1 left crate8)
   goals met: 2 of 18
13. (drone-move warehouse loc6 drone1)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc6)
   goals met: 2 of 18
14. (drone-move loc6 loc8 drone1)
   deleted: (drone-at drone1 loc6)
   added: (drone-at drone1 loc8)
   goals met: 2 of 18
15. (drop-crate loc8 person9 crate2 right food drone1)
   deleted: (has-crate-drone-arm drone1 right crate2)
   added: (has-content-person person9 food) (empty-arm drone1 right)
   goals met: 3 of 18
16. (drone-move loc8 warehouse drone1)
   deleted: (drone-at drone1 loc8)
   added: (drone-at drone1 warehouse)
   goals met: 3 of 18
17. (pick-up-crate crate3 warehouse drone1 right)
   deleted: (empty-arm drone1 right) (crate-at crate3 warehouse)
   added: (has-crate-drone-arm drone1 right crate3)
   goals met: 3 of 18
18. (drone-move warehouse loc6 drone1)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc6)
   goals met: 3 of 18
19. (drone-move loc6 loc2 drone1)
   deleted: (drone-at drone1 loc6)
   added: (drone-at drone1 loc2)
   goals met: 3 of 18
20. (drop-crate loc2 person10 crate8 left medicine drone1)
   deleted: (has-crate-drone-arm drone1 left crate8)
   added: (has-content-person person10 medicine) (empty-arm drone1 left)
   goals met: 4 of 18
21. (drone-move loc2 warehouse drone1)
   deleted: (drone-at drone1 loc2)
   added: (drone-at drone1 warehouse)
   goals met: 4 of 18
22. (pick-up-crate crate9 warehouse drone1 left)
   deleted: (empty-arm drone1 left) (crate-at crate9 warehouse)
   added: (has-crate-drone-arm drone1 left crate9)
   goals met: 4 of 18
23. (drone-move warehouse loc6 drone1)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc6)
   goals met: 4 of 18
24. (drop-crate loc6 person2 crate3 right food drone1)
   deleted: (has-crate-drone-arm drone1 right crate3)
   added: (has-content-person person2 food) (empty-arm drone1 right)
   goals met: 5 of 18
25. (drone-move loc6 warehouse drone1)
   deleted: (drone-at drone1 loc6)
   added: (drone-at drone1 warehouse)
   goals met: 5 of 18
26. (pick-up-crate crate4 warehouse drone1 right)
   deleted: (empty-arm drone1 right) (crate-at crate4 warehouse)
   added: (has-crate-drone-arm drone1 right crate4)
   goals met: 5 of 18
27. (drone-move warehouse loc6 drone1)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc6)
   goals met: 5 of 18
28. (drop-crate loc6 person2 crate9 left medicine drone1)
   deleted: (has-crate-drone-arm drone1 left crate9)
   added: (has-content-person person2 medicine) (empty-arm drone1 left)
   goals met: 6 of 18
29. (drone-move loc6 warehouse drone1)
   deleted: (drone-at drone1 loc6)
   added: (drone-at drone1 warehouse)
   goals met: 6 of 18
30. (pick-up-crate crate10 warehouse drone1 left)
   deleted: (empty-arm drone1 left) (crate-at crate10 warehouse)
   added: (has-crate-drone-arm drone1 left crate10)
   goals met: 6 of 18
31. (drone-move warehouse loc11 drone1)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc11)
   goals met: 6 of 18
32. (drop-crate loc11 person7 crate4 right food drone1)
   deleted: (has-crate-drone-arm drone1 right crate4)
   added: (has-content-person person7 food) (empty-arm drone1 right)
   goals met: 7 of 18
33. (drone-move loc11 warehouse drone1)
   deleted: (drone-at drone1 loc11)
   added: (drone-at drone1 warehouse)
   goals met: 7 of 18
34. (pick-up-crate crate5 warehouse drone1 right)
   deleted: (empty-arm drone1 right) (crate-at crate5 warehouse)
   added: (has-crate-drone-arm drone1 right crate5)
   goals met: 7 of 18
35. (drone-move warehouse loc11 drone1)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc11)
   goals met: 7 of 18
36. (drop-crate loc11 person7 crate10 left medicine drone1)
   deleted: (has-crate-drone-arm drone1 left crate10)
   added: (has-content-person person7 medicine) (empty-arm drone1 left)
   goals met: 8 of 18
37. (drone-move loc11 warehouse drone1)
   deleted: (drone-at drone1 loc11)
   added: (drone-at drone1 warehouse)
   goals met: 8 of 18
38. (pick-up-crate crate11 warehouse drone1 left)
   deleted: (empty-arm drone1 left) (crate-at crate11 warehouse)
   added: (has-crate-drone-arm drone1 left crate11)
   goals met: 8 of 18
39. (drone-move warehouse loc11 drone1)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc11)
   goals met: 8 of 18
40. (drop-crate loc11 person8 crate11 left medicine drone1)
   deleted: (has-crate-drone-arm drone1 left crate11)
   added: (has-content-person person8 medicine) (empty-arm drone1 left)
   goals met: 9 of 18
41. (drone-move loc11 warehouse drone1)
   deleted: (drone-at drone1 loc11)
   added: (drone-at drone1 warehouse)
   goals met: 9 of 18
42. (pick-up-crate crate12 warehouse drone1 left)
   deleted: (empty-arm drone1 left) (crate-at crate12 warehouse)
   added: (has-crate-drone-arm drone1 left crate12)
   goals met: 9 of 18
43. (drone-move warehouse loc11 drone1)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc11)
   goals met: 9 of 18
44. (drop-crate loc11 person11 crate12 left medicine drone1)
   deleted: (has-crate-drone-arm drone1 left crate12)
   added: (has-content-person person11 medicine) (empty-arm drone1 left)
   goals met: 10 of 18
45. (drone-move loc11 warehouse drone1)
   deleted: (drone-at drone1 loc11)
   added: (drone-at drone1 warehouse)
   goals met: 10 of 18
46. (pick-up-crate crate13 warehouse drone1 left)
   deleted: (empty-arm drone1 left) (crate-at crate13 warehouse)
   added: (has-crate-drone-arm drone1 left crate13)
   goals met: 10 of 18
47. (drone-move warehouse loc11 drone1)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc11)
   goals met: 10 of 18
48. (drop-crate loc11 person12 crate13 left medicine drone1)
   deleted: (has-crate-drone-arm drone1 left crate13)
   added: (has-content-person person12 medicine) (empty-arm drone1 left)
   goals met: 11 of 18
49. (drone-move loc11 warehouse drone1)
   deleted: (drone-at drone1 loc11)
   added: (drone-at drone1 warehouse)
   goals met: 11 of 18
50. (pick-up-crate crate14 warehouse drone1 left)
   deleted: (empty-arm drone1 left) (crate-at crate14 warehouse)
   added: (has-crate-drone-arm drone1 left crate14)
   goals met: 11 of 18
51. (drone-move warehouse loc15 drone1)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc15)
   goals met: 11 of 18
52. (drop-crate loc15 person3 crate5 right food drone1)
   deleted: (has-crate-drone-arm drone1 right crate5)
   added: (has-content-person person3 food) (empty-arm drone1 right)
   goals met: 12 of 18
53. (drone-move loc15 warehouse drone1)
   deleted: (drone-at drone1 loc15)
   added: (drone-at drone1 warehouse)
   goals met: 12 of 18
54. (pick-up-crate crate6 warehouse drone1 right)
   deleted: (empty-arm drone1 right) (crate-at crate6 warehouse)
   added: (has-crate-drone-arm drone1 right crate6)
   goals met: 12 of 18
55. (drone-move warehouse loc15 drone1)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc15)
   goals met: 12 of 18
56. (drop-crate loc15 person16 crate6 right food drone1)
   deleted: (has-crate-drone-arm drone1 right crate6)
   added: (has-content-person person16 food) (empty-arm drone1 right)
   goals met: 13 of 18
57. (drop-crate loc15 person16 crate14 left medicine drone1)
   deleted: (has-crate-drone-arm drone1 left crate14)
   added: (has-content-person person16 medicine) (empty-arm drone1 left)
   goals met: 14 of 18
58. (drone-move loc15 warehouse drone1)
   deleted: (drone-at drone1 loc15)
   added: (drone-at drone1 warehouse)
   goals met: 14 of 18
59. (pick-up-crate crate15 warehouse drone1 right)
   deleted: (empty-arm drone1 right) (crate-at crate15 warehouse)
   added: (has-crate-drone-arm drone1 right crate15)
   goals met: 14 of 18
60. (drone-move warehouse loc9 drone1)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc9)
   goals met: 14 of 18
61. (drop-crate loc9 person6 crate15 right medicine drone1)
   deleted: (has-crate-drone-arm drone1 right crate15)
   added: (has-content-person person6 medicine) (empty-arm drone1 right)
   goals met: 15 of 18
62. (drone-move loc9 warehouse drone1)
   deleted: (drone-at drone1 loc9)
   added: (drone-at drone1 warehouse)
   goals met: 15 of 18
63. (pick-up-crate crate16 warehouse drone1 right)
   deleted: (empty-arm drone1 right) (crate-at crate16 warehouse)
   added: (has-crate-drone-arm drone1 right crate16)
   goals met: 15 of 18
64. (drone-move warehouse loc9 drone1)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc9)
   goals met: 15 of 18
65. (drop-crate loc9 person14 crate16 right medicine drone1)
   deleted: (has-crate-drone-arm drone1 right crate16)
   added: (has-content-person person14 medicine) (empty-arm drone1 right)
   goals met: 16 of 18
66. (drone-move loc9 warehouse drone1)
   deleted: (drone-at drone1 loc9)
   added: (drone-at drone1 warehouse)
   goals met: 16 of 18
67. (pick-up-crate crate17 warehouse drone1 right)
   deleted: (empty-arm drone1 right) (crate-at crate17 warehouse)
   added: (has-crate-drone-arm drone1 right crate17)
   goals met: 16 of 18
68. (drone-move warehouse loc9 drone1)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc9)
   goals met: 16 of 18
69. (drop-crate loc9 person17 crate17 right medicine drone1)
   deleted: (has-crate-drone-arm drone1 right crate17)
   added: (has-content-person person17 medicine) (empty-arm drone1 right)
   goals met: 17 of 18
70. (drone-move loc9 depot drone1)
   deleted: (drone-at drone1 loc9)
   added: (drone-at drone1 depot)
   goals met: 18 of 18
